RearWingAdjoint/0.orig/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            adjointOutletPressure;
        value           $internalField;
    }

    sym
    {
        type            symmetry;
    }

    RW_MP
    {
        type            zeroGradient;
    }

    RW_MP-FINE
    {
        type            zeroGradient;
    }

    RW_END
    {
        type            zeroGradient;
    }

    RW_END-FINE
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
